In [ ]:
#programming with pandas

In [1]:
import pandas
pandas. __version__

'1.2.4'

In [4]:
import pandas as pd
import numpy as np

In [3]:
#series
sinchu = pd.Series([2,5,8,0,4,6])
sinchu

0    2
1    5
2    8
3    0
4    4
5    6
dtype: int64

In [4]:
sinchu.values

array([2, 5, 8, 0, 4, 6], dtype=int64)

In [5]:
sinchu.index

RangeIndex(start=0, stop=6, step=1)

In [17]:
family = pd.Series([4,9,8,7],index=['sinchu','chinthu','amma','appa'])
family

sinchu     4
chinthu    9
amma       8
appa       7
dtype: int64

In [18]:
family['appa']

7

In [10]:
family[0]

0

In [19]:
family.name = 'lucky number'
family.index.name = 'fav persons'
family

fav persons
sinchu     4
chinthu    9
amma       8
appa       7
Name: lucky number, dtype: int64

In [20]:
np.log(family)

fav persons
sinchu     1.386294
chinthu    2.197225
amma       2.079442
appa       1.945910
Name: lucky number, dtype: float64

In [28]:
family[family>8]

fav persons
chinthu    9
Name: lucky number, dtype: int64

In [31]:
family_dict = {'sinchu':4,'chinthu':9,'amma':8,'appa':7}
print(family_dict)
pd.Series(family_dict)

{'sinchu': 4, 'chinthu': 9, 'amma': 8, 'appa': 7}

sinchu     4
chinthu    9
amma       8
appa       7
dtype: int64

In [47]:
#Data Frame
data = {"subject":["dbms","software testing","oops","python"],
           "code":[1800,1700,1600,1500],
       "Literacy":[0.2,0.1,0.5,0.3]}
print(data)

{'subject': ['dbms', 'software testing', 'oops', 'python'], 'code': [1800, 1700, 1600, 1500], 'Literacy': [0.2, 0.1, 0.5, 0.3]}

In [48]:
data = pd.DataFrame(data)
data

            subject  code  Literacy
0              dbms  1800       0.2
1  software testing  1700       0.1
2              oops  1600       0.5
3            python  1500       0.3

In [49]:
#to change order of column
changedorder = pd.DataFrame(data , columns = ["Literacy","subject","code"])
changedorder

   Literacy           subject  code
0       0.2              dbms  1800
1       0.1  software testing  1700
2       0.5              oops  1600
3       0.3            python  1500

In [42]:
#to add new column
changedorder["nonsence"] = changedorder.code/changedorder.Literacy
changedorder

   Literacy           subject  code  nonsence
0       0.2              dbms  1800    9000.0
1       0.1  software testing  1700   17000.0
2       0.5              oops  1600    3200.0
3       0.3            python  1500    5000.0

In [51]:
changedorder["serie_aligned"] = pd.Series(range(5),index = [0,1,2,3,4])
changedorder

   Literacy           subject  code  serie_aligned
0       0.2              dbms  1800              0
1       0.1  software testing  1700              1
2       0.5              oops  1600              2
3       0.3            python  1500              3

In [52]:
changedorder.to_dict()

{'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3},
 'subject': {0: 'dbms', 1: 'software testing', 2: 'oops', 3: 'python'},
 'code': {0: 1800, 1: 1700, 2: 1600, 3: 1500},
 'serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3}}

In [51]:
pd.DataFrame(changedorder.to_dict())

   Literacy           subject  code  nonsence  serie_aligned
0       0.2              dbms  1800    9000.0              0
1       0.1  software testing  1700   17000.0              1
2       0.5              oops  1600    3200.0              2
3       0.3            python  1500    5000.0              3

In [52]:
data = [{"a":i,"b":10*i}for i in range(6)]
print(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

In [53]:
pd.DataFrame(data)

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [54]:
pd.DataFrame([{"aa":1,"bb":2},{"bb":3,"cc":6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [4]:
import numpy as np
import pandas as pd
pd.DataFrame(np.random.randint(2,12),#if we run dis code again we get separate output
            columns = ["foo","bar"],
            index = ['a','b','c'])

   foo  bar
a    7    7
b    7    7
c    7    7

In [6]:
int = pd.Index([20,34,57,7,1,8])
int

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [9]:
int[1]

34

In [10]:
int[::]

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [11]:
int[1:5:2]

Int64Index([34, 7], dtype='int64')

In [13]:
print(int.size,int.shape,int.ndim,int.dtype)

6 (6,) 1 int64

In [14]:
int[1]=0  #index are immutable

TypeError: Index does not support mutable operations

In [19]:
sinchu = np.random.RandomState(10)
second = pd.Series(sinchu.randint(0,10,3))
second

0    9
1    4
2    0
dtype: int32

In [20]:
next = pd.DataFrame(sinchu.randint(0,10,(5,4)),columns = ['a','b','c','d'])
next

   a  b  c  d
0  1  9  0  1
1  8  9  0  8
2  6  4  3  0
3  4  6  8  1
4  8  4  1  3

In [21]:
np.exp(second)

0    8103.083928
1      54.598150
2       1.000000
dtype: float64

In [22]:
np.sin(next*np.pi/4)

              a             b             c             d
0  7.071068e-01  7.071068e-01  0.000000e+00  7.071068e-01
1 -2.449294e-16  7.071068e-01  0.000000e+00 -2.449294e-16
2 -1.000000e+00  1.224647e-16  7.071068e-01  0.000000e+00
3  1.224647e-16 -1.000000e+00 -2.449294e-16  7.071068e-01
4 -2.449294e-16  1.224647e-16  7.071068e-01  7.071068e-01

In [23]:
np.sin(next)

          a         b         c         d
0  0.841471  0.412118  0.000000  0.841471
1  0.989358  0.412118  0.000000  0.989358
2 -0.279415 -0.756802  0.141120  0.000000
3 -0.756802 -0.279415  0.989358  0.841471
4  0.989358 -0.756802  0.841471  0.141120

In [34]:
#index allignment in Series
area = pd.Series({'achu': 20,'rekha':21,'soni': 22, 'theju':23},name = 'area')
Population = pd.Series({'rekha' : 2233,'shimogha':4455,'theju':8899,'thamilnadu':7766},name = 'population')
print(area)
print(Population)

achu     20
rekha    21
soni     22
theju    23
Name: area, dtype: int64
rekha         2233
shimogha      4455
theju         8899
thamilnadu    7766
Name: population, dtype: int64

In [35]:
Population/area

achu                 NaN
rekha         106.333333
shimogha             NaN
soni                 NaN
thamilnadu           NaN
theju         386.913043
dtype: float64

In [37]:
area.index|Population.index

<ipython-input-37-607d13a1ac98>:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  area.index|Population.index

Index(['achu', 'rekha', 'shimogha', 'soni', 'thamilnadu', 'theju'], dtype='object')

In [19]:
A = pd.Series([2,4,6])
B=pd.Series([1,3,4],index = [1,2,3])
print(A)
print(B)

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    4
dtype: int64

In [42]:
A+B  #based on index position

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [43]:
print(df)

NameError: name 'df' is not defined

In [54]:
print(changedorder)

   Literacy           subject  code  serie_aligned
0       0.2              dbms  1800              0
1       0.1  software testing  1700              1
2       0.5              oops  1600              2
3       0.3            python  1500              3

In [55]:
changedorder.to_dict()

{'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3},
 'subject': {0: 'dbms', 1: 'software testing', 2: 'oops', 3: 'python'},
 'code': {0: 1800, 1: 1700, 2: 1600, 3: 1500},
 'serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3}}

In [5]:

df2 = pd.DataFrame({'province':['FL','NH','LH'],
                   'population':[1000,5675,8379]})
df2

  province  population
0       FL        1000
1       NH        5675
2       LH        8379

In [7]:
df3 = pd.DataFrame({'province':['FL','NH'],
                   'population':[10000,50000]})
df3

  province  population
0       FL       10000
1       NH       50000

In [61]:
df2.merge(df3 , right_on = 'province',left_on='province')

  province  population_x  population_y
0       FL          1000         10000
1       NH          5675         50000

In [10]:
df2.merge(df3)

Empty DataFrame
Columns: [province, population]
Index: []

In [14]:
df5 = pd.DataFrame({"province":["FL","NH","FL"],
                   "population":["1000","2000","5000"]})
print(df5)
data = {"province":["FL","FL","NH","NH","ZH"],
       "year":[2013,2014,2013,2014,2014],
       "literacy":[0.2,0.1,0.5,0.3,0.5]}
print(data)
data = pd.DataFrame(data)
data

  province population
0       FL       1000
1       NH       2000
2       FL       5000
{'province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'year': [2013, 2014, 2013, 2014, 2014], 'literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  province  year  literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [15]:
df5.merge(data,how='outer')

  province population  year  literacy
0       FL       1000  2013       0.2
1       FL       1000  2014       0.1
2       FL       5000  2013       0.2
3       FL       5000  2014       0.1
4       NH       2000  2013       0.5
5       NH       2000  2014       0.3
6       ZH        NaN  2014       0.5

In [20]:
#combining data with overlap
serie_a = pd.Series([np.nan , 2.5,np.nan, 3.5,4.5,np.nan],
                   index = ['f','e','d','c','b','a'])
serie_b = pd.Series(np.arange(len(serie_a),dtype = np.float64),
                   index = ['f','e','d','c','b','a'])
print(serie_a)
print(serie_b)

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64
f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [22]:
pd.Series(np.where(pd.isnull(serie_a),serie_b,serie_a),
         index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [25]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64